In [3]:
import pandas as pd

In [5]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [9]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [11]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [13]:
pd.merge(employees, departments, on="DeptID", how="left")    # Left Join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [15]:
pd.merge(employees, departments, on="DeptID", how="right")    # Right Join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [17]:
pd.merge(employees, departments, on="DeptID", how="outer")    # Outer Join

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [19]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

In [21]:
df1

      Name
0  Charlie
1    David

In [23]:
df2

      Name
0  Charlie
1    David

In [25]:
pd.concat([df1, df2])    # By Default "axis=0"

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [27]:
pd.concat([df1, df2], axis=1)

    Name     Name
0  Alice  Charlie
1    Bob    David

In [29]:
pd.concat([df1, df2], axis=0)

      Name
0    Alice
1      Bob
0  Charlie
1    David